/*****************************************************************************************
//	外界访问更新程序接口方法
//	Copyright : Kingsoft 2002
//	Author	  :
//	CreateTime:	2002-9-13
*****************************************************************************************/

//--------------------------------------------------------------------------
//	功能：开始升级程序执行
//	参数：unsigned int uParam --> 保留，请传入0。
//		　int nParam --> 保留，请传入0。
//	注释：
//--------------------------------------------------------------------------
__declspec(dllexport)
int SwordUpdate(unsigned int uParam, int nParam)
{
	return 0;
}

//--------------------------------------------------------------------------
//	功能：获取升级程序执行结果
//	参数：char* pInformation --> 指向一个字符缓冲区的指针，用于获取文本描述的
//								执行信息，此其空间必须大于或者等于256字节。
//		　int nParam --> 保留，请传入0。
//	注释：
//--------------------------------------------------------------------------
__declspec(dllexport)
int	SwordUpdateGetResult(char* pInformation, int nParam)
{
	return 0;
}

//--------------------------------------------------------------------------
//	功能：告知升级程序在完成升级后要如何重新启动程序
//	参数：const char* pApplication --> 指向一个以0结束的字串，表明要执行的程序。
//				此字串中可以包含完整路径，也可以包含相对路径。当包含的是相对路
//				径的时候，将以当前路径作为来定位程序。
//		　char* int nParam --> 指向以0结尾的命令行字符串，可以为NULL。
//	注释：
//--------------------------------------------------------------------------
__declspec(dllexport)
int RegisterAppLaunchedAfterUpdate(const char* pApplicationName, char* pCmdLine)
{
	return 0;
}